Revit 2027 API
CombinableElementArray.Item Property
Gets or sets a CombinableElement at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CombinableElement this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As CombinableElement
	Get
	Set
public:
virtual property CombinableElement^ Item[int index] {
	CombinableElement^ get (int index);
	void set (int index, CombinableElement^ value);
}
abstract Item : CombinableElement with get, set
override Item : CombinableElement with get, set
Parameters
index Int32
The index of the CombinableElement to be set or retrieved.
Return Value
CombinableElement
Returns the CombinableElement at the specified index.
See Also
Reference
CombinableElementArray Class
Autodesk.Revit.DB Namespace